<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Short-intro-to-NumPy" data-toc-modified-id="Short-intro-to-NumPy-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Short intro to NumPy</a></span></li><li><span><a href="#Introduction-to-Pandas-Library" data-toc-modified-id="Introduction-to-Pandas-Library-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Introduction to Pandas Library</a></span><ul class="toc-item"><li><span><a href="#Key-Features-of-Pandas" data-toc-modified-id="Key-Features-of-Pandas-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Key Features of Pandas</a></span></li><li><span><a href="#DataFrames-and-Series-in-Pandas" data-toc-modified-id="DataFrames-and-Series-in-Pandas-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>DataFrames and Series in Pandas</a></span></li></ul></li><li><span><a href="#Series-in-Pandas" data-toc-modified-id="Series-in-Pandas-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Series in Pandas</a></span><ul class="toc-item"><li><span><a href="#Creating-Series" data-toc-modified-id="Creating-Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Creating Series</a></span><ul class="toc-item"><li><span><a href="#From-a-list" data-toc-modified-id="From-a-list-3.1.1"><span class="toc-item-num">3.1.1&nbsp;&nbsp;</span>From a list</a></span></li><li><span><a href="#From-a-list-with-index" data-toc-modified-id="From-a-list-with-index-3.1.2"><span class="toc-item-num">3.1.2&nbsp;&nbsp;</span>From a list with index</a></span></li><li><span><a href="#From-a-dictionary" data-toc-modified-id="From-a-dictionary-3.1.3"><span class="toc-item-num">3.1.3&nbsp;&nbsp;</span>From a dictionary</a></span></li><li><span><a href="#From-a-file" data-toc-modified-id="From-a-file-3.1.4"><span class="toc-item-num">3.1.4&nbsp;&nbsp;</span>From a file</a></span></li></ul></li><li><span><a href="#Data-access-in-Series" data-toc-modified-id="Data-access-in-Series-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Data access in Series</a></span></li><li><span><a href="#Methods-in-Series" data-toc-modified-id="Methods-in-Series-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Methods in Series</a></span><ul class="toc-item"><li><span><a href="#concat()" data-toc-modified-id="concat()-3.3.1"><span class="toc-item-num">3.3.1&nbsp;&nbsp;</span><code>concat()</code></a></span></li><li><span><a href="#sort_values()-and-sort_index()" data-toc-modified-id="sort_values()-and-sort_index()-3.3.2"><span class="toc-item-num">3.3.2&nbsp;&nbsp;</span><code>sort_values() and sort_index()</code></a></span></li><li><span><a href="#value_counts()" data-toc-modified-id="value_counts()-3.3.3"><span class="toc-item-num">3.3.3&nbsp;&nbsp;</span><code>value_counts()</code></a></span></li></ul></li><li><span><a href="#ðŸ’¡-Check-for-understanding" data-toc-modified-id="ðŸ’¡-Check-for-understanding-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>ðŸ’¡ Check for understanding</a></span></li></ul></li><li><span><a href="#Dataframes-in-Pandas" data-toc-modified-id="Dataframes-in-Pandas-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Dataframes in Pandas</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#head()-and-tail()" data-toc-modified-id="head()-and-tail()-4.0.1"><span class="toc-item-num">4.0.1&nbsp;&nbsp;</span><code>head()</code> and <code>tail()</code></a></span></li><li><span><a href="#index,-columns-and-values" data-toc-modified-id="index,-columns-and-values-4.0.2"><span class="toc-item-num">4.0.2&nbsp;&nbsp;</span><code>index, columns and values</code></a></span></li></ul></li><li><span><a href="#Data-access-in-Dataframe" data-toc-modified-id="Data-access-in-Dataframe-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Data access in Dataframe</a></span><ul class="toc-item"><li><span><a href="#Columns" data-toc-modified-id="Columns-4.1.1"><span class="toc-item-num">4.1.1&nbsp;&nbsp;</span>Columns</a></span></li><li><span><a href="#Rows" data-toc-modified-id="Rows-4.1.2"><span class="toc-item-num">4.1.2&nbsp;&nbsp;</span>Rows</a></span></li><li><span><a href="#Specific-values" data-toc-modified-id="Specific-values-4.1.3"><span class="toc-item-num">4.1.3&nbsp;&nbsp;</span>Specific values</a></span></li></ul></li><li><span><a href="#More-DataFrame-Methods" data-toc-modified-id="More-DataFrame-Methods-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>More DataFrame Methods</a></span><ul class="toc-item"><li><span><a href="#shape" data-toc-modified-id="shape-4.2.1"><span class="toc-item-num">4.2.1&nbsp;&nbsp;</span><code>shape</code></a></span></li><li><span><a href="#describe()" data-toc-modified-id="describe()-4.2.2"><span class="toc-item-num">4.2.2&nbsp;&nbsp;</span><code>describe()</code></a></span></li><li><span><a href="#info()" data-toc-modified-id="info()-4.2.3"><span class="toc-item-num">4.2.3&nbsp;&nbsp;</span><code>info()</code></a></span></li><li><span><a href="#nunique()-and-unique()" data-toc-modified-id="nunique()-and-unique()-4.2.4"><span class="toc-item-num">4.2.4&nbsp;&nbsp;</span><code>nunique() and unique()</code></a></span></li><li><span><a href="#dtypes" data-toc-modified-id="dtypes-4.2.5"><span class="toc-item-num">4.2.5&nbsp;&nbsp;</span><code>dtypes</code></a></span></li><li><span><a href="#select_dtypes()" data-toc-modified-id="select_dtypes()-4.2.6"><span class="toc-item-num">4.2.6&nbsp;&nbsp;</span><code>select_dtypes()</code></a></span></li><li><span><a href="#Aggregation-such-as-max()" data-toc-modified-id="Aggregation-such-as-max()-4.2.7"><span class="toc-item-num">4.2.7&nbsp;&nbsp;</span>Aggregation such as <code>max()</code></a></span></li></ul></li><li><span><a href="#ðŸ’¡-Check-for-understanding" data-toc-modified-id="ðŸ’¡-Check-for-understanding-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>ðŸ’¡ Check for understanding</a></span></li></ul></li><li><span><a href="#Summary" data-toc-modified-id="Summary-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Summary</a></span></li><li><span><a href="#Extra:-Creating-Dataframes-from-a-Dictionary" data-toc-modified-id="Extra:-Creating-Dataframes-from-a-Dictionary-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Extra: Creating Dataframes from a Dictionary</a></span></li><li><span><a href="#Extra:-pickle" data-toc-modified-id="Extra:-pickle-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Extra: pickle</a></span><ul class="toc-item"><li><span><a href="#Saving-DataFrames-with-Pickle" data-toc-modified-id="Saving-DataFrames-with-Pickle-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Saving DataFrames with Pickle</a></span></li><li><span><a href="#Loading-DataFrames-from-Pickle" data-toc-modified-id="Loading-DataFrames-from-Pickle-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Loading DataFrames from Pickle</a></span></li></ul></li></ul></div>

# Short intro to NumPy

Let's start by mentioning NumPy as Pandas builds on top of NumPy.

NumPy is a powerful library for numerical computing in Python. It provides support for large, multi-dimensional arrays and matrices, along with an extensive collection of mathematical functions to operate on these arrays efficiently.

Opening in existing browser session.

# Introduction to Pandas Library

`pandas` is a powerful library designed for working with tabulated and tagged data, making it ideal for handling spreadsheets, SQL tables, and more. It revolves around two main data structures: `Series` and `DataFrames`.

## Key Features of Pandas

- Robust data import/export: `pandas` provides efficient tools to read and write data from various file formats like CSV, XLS, SQL, and HDF5.
- Data manipulation: With `pandas`, you can easily filter, add, or delete data, enabling seamless data processing.
- High-performance and versatility: It combines the performance of `numpy` arrays with the ability to handle tabulated data efficiently.

To import the necessary modules from the `pandas` library, we use the following syntax:

![](https://github.com/data-bootcamp-v4/lessons/blob/main/img/pandas.svg?raw=true)

## DataFrames and Series in Pandas

In `pandas`, a `Series` is a one-dimensional array of data with associated labels called the *index*. If no index is specified, it generates an ordered sequence of integers.

```python
# Creating a Series
s = pd.Series(data, index=index)
```

On the other hand, a `DataFrame` is a two-dimensional data structure that stores data in tabular form, with labeled rows and columns. Each row represents an observation, and each column represents a variable. `DataFrame` can handle heterogeneous data with different types (numeric, string, boolean, etc.). It also includes variable names, types, and methods to access and modify the data.

```python
# Creating a DataFrame
df = pd.DataFrame(data, ...)
```

---
# Series in Pandas

## Creating Series

### From a list

Create a Series with default indexes from a list

In [3]:
pip install pandas

Collecting pandas
  Using cached pandas-2.2.3-cp312-cp312-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (89 kB)
Collecting numpy>=1.26.0 (from pandas)
  Using cached numpy-2.2.4-cp312-cp312-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (62 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/samyak/PycharmProjects/DS_2025_ICK/.venv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /home/samyak/PycharmProjects/DS_2025_ICK/.venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Using cached pandas-2.2.3-cp312-cp312-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (12.7 MB)
Using cached numpy-2.2.4-cp312-cp312-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (16.1 MB)
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.2.4 pandas-2.2.3 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

In [5]:
import pandas as pd

mylst= [1990,1989,1988,1987]
serise= pd.Series(mylst)
serise

0    1990
1    1989
2    1988
3    1987
dtype: int64

In [7]:
serise.values

array([1990, 1989, 1988, 1987])

In [8]:
serise.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
for i,v in serise.items():
    print("index",i)
    print("values",v)

index 0
values 1990
index 1
values 1989
index 2
values 1988
index 3
values 1987

In [14]:
new_serise = pd.Series([1992,1994,1995,1996], 
index=['A','B','C','D'])
new_serise.index

Index(['A', 'B', 'C', 'D'], dtype='object')

The `Series` have two attributes:` values` and `index`. The first is a `numpy array` that stores the data, and the second is an object that contains the indexes.

In [48]:
url="https://raw.githubusercontent.com/data-bootcamp-v4/data/main/titanic_train.csv"
df= pd.read_csv(url,usecols=["Name"])
df.head()

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry

In Pandas, `Series.items()` is a method used to iterate over the elements of a Pandas Series. It returns an iterator that yields the index-label and corresponding value pairs of the Series.

In [47]:
new_serise

A    1992
B    1994
C    1995
D    1996
dtype: int64

In [21]:
new_serise[1:3]

B    1994
C    1995
dtype: int64

In [26]:
s3= pd.concat([new_serise,new_serise],ignore_index='True')
s3

0    1992
1    1994
2    1995
3    1996
4    1992
5    1994
6    1995
7    1996
dtype: int64

### From a list with index

When creating a `Series`, you can explicitly define an `array` index and pass it as an argument.


Creating series with defined indexes

In [49]:
df.head()

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry

In [50]:

df.sort_index(ascending=True,inplace=True)
df

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
886                              Montvila, Rev. Juozas
887                       Graham, Miss. Margaret Edith
888           Johnston, Miss. Catherine Helen "Carrie"
889                              Behr, Mr. Karl Howell
890                                Dooley, Mr. Patrick

[891 rows x 1 columns]

### From a dictionary

In [51]:
df.value_counts()

Name
van Melkebeke, Mr. Philemon         1
Abbing, Mr. Anthony                 1
Abbott, Mr. Rossmore Edward         1
Abbott, Mrs. Stanton (Rosa Hunt)    1
Abelson, Mr. Samuel                 1
                                   ..
Allen, Mr. William Henry            1
Allen, Miss. Elisabeth Walton       1
Ali, Mr. William                    1
Ali, Mr. Ahmed                      1
Alhomaki, Mr. Ilmari Rudolf         1
Name: count, Length: 891, dtype: int64

### From a file

`read_csv()` is a Pandas function used to read data from a CSV file and create a DataFrame.

When assigning one column in the parameter `usecols` and then calling the method `squeeze("columns")`, the resulst is a Series instead of a Dataframe

In [ ]:
# Load Titanic dataset from an online source
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/titanic_train.csv'

In [3]:
import pandas as pd

df= pd.read_csv(url)#,usecols=['Embarked'])
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [70]:
df.value_counts()

Embarked
S           644
C           168
Q            77
Name: count, dtype: int64

In [ ]:
df.sort_index(ascending=False,inplace=True)

    Embarked
890        Q
889        C
888        S
887        S
886        S
..       ...
4          S
3          S
2          S
1          C
0          S

[891 rows x 1 columns]

In [82]:
r=df.value_counts().idxmax()
r

('S',)



---
## Data access in Series

Data access in Pandas can be achieved through either the categorical index or the internally generated numerical index.

    Embarked
886        S
887        S
888        S
889        C
890        Q

Embarked
S           644
C           168
Q            77
Name: count, dtype: int64

    Embarked
890        Q
889        C
888        S
887        S
886        S
..       ...
4          S
3          S
2          S
1          C
0          S

[891 rows x 1 columns]

ValueError: No axis named Embarked for object type DataFrame



---
## Methods in Series

### `concat()`

`concat()` is a pandas function used to concatenate and combine DataFrames along a specified axis, either vertically (rows) or horizontally (columns).

By default `concat` keeps the original indexes. It does not restart the index by default, unless we specify `ignore_index=True`.

### `sort_values() and sort_index()`

`sort_values()` is a pandas DataFrame method that sorts the DataFrame based on specified column(s), while `sort_index()` sorts the DataFrame based on its index labels.

Sort index or sort values does not change the series.
We can either save it again in the variable or we can use a paremeter
called **inplace**.

### `value_counts()`

`value_counts()` is a Pandas function that returns a Series containing the counts of unique values in a Series or DataFrame.

## ðŸ’¡ Check for understanding

In [ ]:
titanic_series

1. Get the column "Embarked" from the Titanic csv as a Pandas Series
2. Print the first value
3. Print the last 5 values
3. Append "NA" to the Series
3. Get the number of each Embarked type (number of repeated values)
3. Order the Series *descending*, and print the Embarked type most repeated in the Series

In [ ]:
# Your code goes here


# Dataframes in Pandas

Unlike `Series`, `DataFrame` is designed to store heterogeneous multivariable data. It can be created from dictionaries (look to Extra section for examples).

We will use `read_csv` to read data from a CSV file and create a DataFrame.

We won't be using now the parameter `usecols` nor calling the method `squeeze("columns")`.

In [108]:
# Load Titanic dataset from an online source
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/titanic_train.csv'

### `head()` and `tail()`

The `head()` method returns the first few rows of a DataFrame or Series, while the `tail()` method returns the last few rows.

In [92]:
df_1= df.copy()
df_1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [100]:
df_1[["Sex", "Age"]]

        Sex   Age
0      male  22.0
1    female  38.0
2    female  26.0
3    female  35.0
4      male  35.0
..      ...   ...
886    male  27.0
887  female  19.0
888  female   NaN
889    male  26.0
890    male  32.0

[891 rows x 2 columns]

### `index, columns and values`

The `index` attribute in Pandas returns the index labels of a DataFrame or Series, and the `columns` attribute returns the column labels of a DataFrame.

`RangeIndex(start=0, stop=1460, step=1)` is a special type of index in Pandas called a `RangeIndex`. It represents a range of integer values starting from 0, up to (but not including) 1460, with a step size of 1.

In Pandas, `df.values` is an attribute that returns the underlying NumPy array of a DataFrame df. It represents the actual data stored in the DataFrame as a two-dimensional NumPy array.


Additionally, `Pandas` can create Dataframes from other sources, such as JSON, URL ...


---
## Data access in Dataframe

### Columns

You can extract columns from a `DataFrame` using dictionary-like notation or as attributes, obtaining a `Series` object in both cases, provided the column label is a valid Python identifier.

In [ ]:
titanic_df["Sex"] #dict way of accesing a column

In [ ]:
titanic_df.Sex #attribute access of the column

#this only works if the name doesn't have weird things, this means
#no spaces!!!

In [ ]:
titanic_df[["Sex"]] #by using double [] we get a Dataframe instead
# of a series

In [ ]:
titanic_df[["Sex", "Fare"]]

### Rows

To access rows in a Pandas DataFrame, you can use the `iloc` attribute with integer-based indexing or the `loc` attribute with label-based indexing. For example, `df.iloc[0]` will access the first row, and `df.loc['row_label']` will access the row with the specified label.


<div class="alert alert-info">Note: Consult http://pandas.pydata.org/pandas-docs/version/0.18.1/indexing.html#different-choices-for-indexing to understand the differences between methods.</div>

Just for the sake of this example, we will create a dictionary with a non-default index.

In [ ]:
d_index = {
    "name": ["Paula", "Mark"],
    "score": [98.5, 95]
}

df_index = pd.DataFrame(d_index, index=["123A", "789B"])
df_index


**loc** is used for label-based indexing to access rows.


**iloc** is used for integer-based indexing in Pandas to access rows

### Specific values

Here's a summary of the different ways to access individual values in a Pandas DataFrame:

1. `df.loc[row_label][column_label]`: Chooses the row with the label and then the value in that row with the column label.

2. `df.iloc[row_position][column_label]`: Selects the row with the position and then the value in that row with the column label.

3. `df.loc[row_label, column_label]`: Directly accesses the value using both row and column labels.

4. `df.iloc[row_position, column_position]`: Directly accesses the value using both row and column positions.

Note: you might see `df[row_label][column_label]`, even though is less recommended that using `loc()`.


---
## More DataFrame Methods


Let's see some useful methods of the Dataframe class.

### `shape`

`shape` is a Pandas attribute that returns a tuple representing the dimensions of a DataFrame or Series, indicating the number of rows and columns, while `shape()` is not a valid function in Pandas, and attempting to call it will result in an AttributeError.

### `describe()`

`describe()` is a Pandas method that generates descriptive statistics of a DataFrame, providing information on count, mean, standard deviation, minimum, maximum, and quartiles for each numerical column.

### `info()`

`info()` is a Pandas method that provides a concise summary of a DataFrame, including information about the data types, non-null values, and memory usage.

### `nunique() and unique()`

`nunique()` is a Pandas function that returns the number of unique elements in a Series or DataFrame, while `unique()` returns an array of unique elements in a Series or DataFrame.

### `dtypes`

`dtypes` is a Pandas attribute that returns the data types of each column in a DataFrame, while `dtype` is a method that returns the data type of a single element in a Series or DataFrame.

### `select_dtypes()`

`select_dtypes()` is a pandas function used to filter columns in a DataFrame based on their data types. It allows you to select numeric, object (string), boolean, datetime, or categorical columns.

Syntax:
```python
DataFrame.select_dtypes(include=None, exclude=None)
```

- `include`: A list of data types or strings representing data types to include in the selection. If specified, only columns with these data types will be included.
- `exclude`: A list of data types or strings representing data types to exclude from the selection. If specified, columns with these data types will be excluded.

Example:
```python
# Assuming df is a DataFrame
numeric_columns = df.select_dtypes(include='number')
object_columns = df.select_dtypes(include='object')
```

### Aggregation such as `max()`

 Just like `max()`, there are many methods that can be applied to either the entire dataframe or its individual columns.

## ðŸ’¡ Check for understanding

- a. Use the original titanic_df
- b. Select the `Sex` and `Fare` columns.
- c. Indicate how many different types of `Sex` there are.
- d. Indicate how many `Sex` of each type there are.
- e. Show a statistical summary of all the variables.
- f. Write some conclusions

In [110]:
df2= pd.read_csv(url)
df2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [120]:
df3.nunique()

Sex       2
Fare    248
dtype: int64

In [124]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [127]:
df2.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [116]:
df3=df2[["Sex","Fare"]]
print("The Sex and Fare column \n",df3)

The Sex and Fare column
         Sex     Fare
0      male   7.2500
1    female  71.2833
2    female   7.9250
3    female  53.1000
4      male   8.0500
..      ...      ...
886    male  13.0000
887  female  30.0000
888  female  23.4500
889    male  30.0000
890    male   7.7500

[891 rows x 2 columns]

In [125]:
df3.value_counts("Sex")

Sex
male      577
female    314
Name: count, dtype: int64

In [128]:
df2.describe().all()

PassengerId     True
Survived       False
Pclass          True
Age             True
SibSp          False
Parch          False
Fare           False
dtype: bool

# Summary

- Pandas is a library designed for working with tabulated and tagged data, making it ideal for handling spreadsheets, SQL tables, and more, built on top of NumPy.
- DataFrames and Series are the two main data structures in Pandas.
- Series is a one-dimensional array of data with associated labels called the index, while DataFrame is a two-dimensional tabular data structure with labeled rows and columns.
- Data access in Series and DataFrame can be achieved using integer-based indexing (iloc), label-based indexing (loc), or dictionary-like notation for column access.
- Series and DataFrame have various methods, such as sort_values(), sort_index(), value_counts(), describe(), info(), nunique(), unique(), dtypes, and select_dtypes().

# Extra: Creating Dataframes from a Dictionary

In [ ]:
std_dic={}

In [ ]:
# Create a Dataframe from a dictionary with
# automatic indexes

d = {"Student": ["Moses", "Samyak", "Ana", "Jose", "Sarah"],
     "year": [2000, 2001, 2002, 2001, 2002],
     "avg": [1.5, 1.7, 3.6, 2.4, 1.9]
}

df = pd.DataFrame(d)
df


DataFrame from a dictionary of lists and indexes

In [ ]:
d_index = {
    "name": ["Paula", "Mark"],
    "score": [98.5, 95]
}

df_index = pd.DataFrame(d_index, index=["123A", "789B"])
df_index

In [104]:
std_dic = {"Student": ["Moses", "Samyak", "Ana", "Jose", "Sarah"],
     "Country": ["Nigeria","India","Spain","Spain","Egypt"],
     "OS": ["Windows","Ubuntu","Windows","MacOS","Windows"]
}
std_df= pd.DataFrame(std_dic)
std_df

  Student  Country       OS
0   Moses  Nigeria  Windows
1  Samyak    India   Ubuntu
2     Ana    Spain  Windows
3    Jose    Spain    MacOS
4   Sarah    Egypt  Windows

In [105]:
std_df[std_df["Country"]=='Spain']

  Student Country       OS
2     Ana   Spain  Windows
3    Jose   Spain    MacOS

# Extra: pickle

In [107]:
std_df[std_df["Country"]=='Spain']

  Student Country       OS
2     Ana   Spain  Windows
3    Jose   Spain    MacOS

Pandas `pickle` function provides a convenient way to save and load Python objects, including DataFrames, to and from disk. Pickling allows you to serialize Python objects into a binary format, making it easy to store large datasets or complex data structures. It's a great tool for saving and restoring your work, especially when dealing with large datasets that might take a long time to process or recreate.

## Saving DataFrames with Pickle

You can use the `to_pickle()` method in pandas to save a DataFrame to a pickle file. This method takes the file path as an argument and creates a binary representation of the DataFrame, which is then saved to the specified file.

In [ ]:
import pandas as pd

# Assuming df is your DataFrame
df.to_pickle('data.pkl')

## Loading DataFrames from Pickle

To load a DataFrame from a pickle file, you can use the `read_pickle()` function in pandas. This function reads the binary data from the pickle file and converts it back into a DataFrame.

In [ ]:
import pandas as pd

# Load DataFrame from pickle file
df = pd.read_pickle('data.pkl')

In [ ]:
df.head()